RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_tmra.c
    u32PERARAddr = (uint32_t)&TMRAx->PERAR;
    u32CNTERAddr = (uint32_t)&TMRAx->CNTER;
    u32CMPARAddr = (uint32_t)&TMRAx->CMPAR1;
    u32CCONRAddr = (uint32_t)&TMRAx->CCONR1;
    u32PCONRAddr = (uint32_t)&TMRAx->PCONR1;

    for (i = 0U; i < u32ChNum; i++) {
        u32AddrOffset = i * 4U;
        RW_MEM16(u32CMPARAddr + u32AddrOffset) = 0xFFFFU;
        RW_MEM16(u32CCONRAddr + u32AddrOffset) = 0x0U;
        RW_MEM16(u32PCONRAddr + u32AddrOffset) = 0x0U;
    }

    SET_VAL_BY_ADDR(u32PERARAddr, 0xFFFFFFFFUL);
    SET_VAL_BY_ADDR(u32CNTERAddr, 0x0U);
    WRITE_REG16(TMRAx->BCSTR, 0x2U);
    WRITE_REG16(TMRAx->ICONR, 0x0U);
    WRITE_REG16(TMRAx->ECONR, 0x0U);
    WRITE_REG16(TMRAx->FCONR, 0x0U);
    WRITE_REG16(TMRAx->STFLR, 0x0U);
    WRITE_REG16(TMRAx->HCONR, 0x0U);
    WRITE_REG16(TMRAx->HCUPR, 0x0U);
    WRITE_REG16(TMRAx->HCDOR, 0x0U);

    WRITE_REG16(TMRAx->BCONR1, 0x0U);
    WRITE_REG16(TMRAx->BCONR2, 0x0U);
    WRITE_REG16(TMRAx->BCONR3, 0x0U);
    WRITE_REG16(TMRAx->BCONR4, 0x0U);
}

/**
 * @brief  Get the counting direction of the specified TMRA unit.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x or CM_TMRA
 * @retval An uint16_t type value of counting direction.
 *          -TMRA_DIR_DOWN:             TMRA count down.
 *          -TMRA_DIR_UP:               TMRA count up.
 */
uint16_t TMRA_GetCountDir(const CM_TMRA_TypeDef *TMRAx)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    return READ_REG16_BIT(TMRAx->BCSTR, TMRA_BCSTR_DIR);
}

/**
 * @brief  Set period value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x or CM_TMRA
 * @param  [in]  u32Value               The period value to be set.
 *                                      This parameter can be a number between:
 *                                      0UL and 0xFFFFFFFFUL for TimerA1 and TimerA2 of HC32F472.
 *                                      0UL and 0xFFFFUL for TimerA3/4/5/6 of HC32F472 and all TimerA units of other MCUs.
 * @retval None
 */
void TMRA_SetPeriodValue(CM_TMRA_TypeDef *TMRAx, uint32_t u32Value)
{
    uint32_t u32PERARAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    u32PERARAddr = (uint32_t)&TMRAx->PERAR;
    SET_VAL_BY_ADDR(u32PERARAddr, u32Value);
}

/**
 * @brief  Get period value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x or CM_TMRA
 * @retval An uint32_t type type value of period value between:
 *         - 0UL and 0xFFFFFFFFUL for TimerA1 and TimerA2 of HC32F472.
 *         - 0UL and 0xFFFFUL for TimerA3/4/5/6 of HC32F472 and all TimerA units of other MCUs.
 */
uint32_t TMRA_GetPeriodValue(const CM_TMRA_TypeDef *TMRAx)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    return (TMRAx->PERAR);
}

/**
 * @brief  Set general counter value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x or CM_TMRA
 * @param  [in]  u32Value               The general counter value to be set.
 *                                      This parameter can be a number between:
 *                                      0UL and 0xFFFFFFFFUL for TimerA1 and TimerA2 of HC32F472.
 *                                      0UL and 0xFFFFUL for TimerA3/4/5/6 of HC32F472 and all TimerA units of other MCUs.
 * @retval None
 */
void TMRA_SetCountValue(CM_TMRA_TypeDef *TMRAx, uint32_t u32Value)
{
    uint32_t u32CNTERAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    u32CNTERAddr = (uint32_t)&TMRAx->CNTER;
    SET_VAL_BY_ADDR(u32CNTERAddr, u32Value);
}

/**
 * @brief  Get general counter value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x or CM_TMRA
 * @retval An uint32_t type type value of counter value between:
 *         - 0UL and 0xFFFFFFFFUL for TimerA1 and TimerA2 of HC32F472.
 *         - 0UL and 0xFFFFUL for TimerA3/4/5/6 of HC32F472 and all TimerA units of other MCUs.
 */
uint32_t TMRA_GetCountValue(const CM_TMRA_TypeDef *TMRAx)
{
    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    return (TMRAx->CNTER);
}

/**
 * @brief  Set comparison value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x or CM_TMRA
 * @param  [in]  u32Ch                  TMRA channel.
 *                                      This parameter can be a value of @ref TMRA_Channel
 * @param  [in]  u32Value               The comparison value to be set.
 *                                      This parameter can be a number between:
 *                                      0UL and 0xFFFFFFFFUL for TimerA1 and TimerA2 of HC32F472.
 *                                      0UL and 0xFFFFUL for TimerA3/4/5/6 of HC32F472 and all TimerA units of other MCUs.
 * @retval None
 */
void TMRA_SetCompareValue(CM_TMRA_TypeDef *TMRAx, uint32_t u32Ch, uint32_t u32Value)
{
    uint32_t u32CMPARAddr;

    DDL_ASSERT(IS_TMRA_UNIT_CH(TMRAx, u32Ch));

    u32CMPARAddr = (uint32_t)&TMRAx->CMPAR1 + u32Ch * 4U;
    SET_VAL_BY_ADDR(u32CMPARAddr, u32Value);
}

/**
 * @brief  Get comparison value.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x or CM_TMRA
 * @param  [in]  u32Ch                  TMRA channel.
 *                                      This parameter can be a value of @ref TMRA_Channel
 * @retval An uint32_t type type value of comparison value value between:
 *         - 0UL and 0xFFFFFFFFUL for TimerA1 and TimerA2 of HC32F472.
 *         - 0UL and 0xFFFFUL for TimerA3/4/5/6 of HC32F472 and all TimerA units of other MCUs.
 */
uint32_t TMRA_GetCompareValue(const CM_TMRA_TypeDef *TMRAx, uint32_t u32Ch)
{
    uint32_t u32CMPARAddr;

    DDL_ASSERT(IS_TMRA_UNIT_CH(TMRAx, u32Ch));

    u32CMPARAddr = (uint32_t)&TMRAx->CMPAR1 + u32Ch * 4U;
    return GET_VAL_BY_ADDR(u32CMPARAddr);
}

/* Sync start. */
/**
 * @brief  Enable or disable synchronous-start. When an even unit enables synchronous-start function,
 *         start the symmetric odd unit can start the even unit at the same time.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x(x is an even number)
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRA_SyncStartCmd(CM_TMRA_TypeDef *TMRAx, en_functional_state_t enNewState)
{
    uint32_t u32Addr;

    DDL_ASSERT(IS_TMRA_SYNC_UNIT(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Addr = (uint32_t)&TMRAx->BCSTR;
    WRITE_REG32(PERIPH_BIT_BAND(u32Addr, TMRA_BCSTR_SYNST_POS), enNewState);
}

/* Reload and continue counting when overflow/underflow? */

/**
 * @brief  Specifies the condition of compare value buffer transmission.
 * @param  [in]  TMRAx                  Pointer to TMRA instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  CM_TMRA_x or CM_TMRA
 * @param  [in]  u32Ch                  TMRA channel.
 *                                      This parameter can be one of the odd channels of @ref TMRA_Channel
 * @param  [in]  u16Cond                Buffer condition of the specified TMRA unit.
 *                                      This parameter can be a value of @ref TMRA_Cmp_Value_Buf_Trans_Cond
 *   @arg  TMRA_BUF_TRANS_COND_OVF_UDF_CLR: This configuration value applies to non-triangular wave counting mode.
 *                                      When counting overflow or underflow or counting register was cleared,
 *                                      transfer CMPARm(m=2,4,6,8,...) to CMPARn(n=1,3,5,7,...).
 *   @arg  TMRA_BUF_TRANS_COND_PEAK:    In triangle wave count mode, when count reached peak,
 *                                      transfer CMMARm(m=2,4,6,8,...) to CMMARn(n=1,3,5,7,...).
 *   @arg  TMRA_BUF_TRANS_COND_VALLEY:  In triangle wave count mode, when count reached valley,
 *                                      transfer CMMARm(m=2,4,6,8,...) to CMMARn(n=1,3,5,7,...).
 * @retval None
 */
void TMRA_SetCompareBufCond(CM_TMRA_TypeDef *TMRAx, uint32_t u32Ch, uint16_t u16Cond)
{
    uint32_t u32BCONRAddr;

    DDL_ASSERT(IS_TMRA_UNIT(TMRAx));
    DDL_ASSERT(IS_TMRA_CMPVAL_BUF_CH(u32Ch));
    DDL_ASSERT(IS_TMRA_CMPVAL_BUF_COND(u16Cond));

